# Pair Programming Pandas I

1. ¬øQu√© diferencia hay entre una Serie y un DataFrame?

- una serie es unidimensional
- una DataFrame es bidimensional

2. Momento de trabajar con Series. Contestad a las siguientes preguntas:

- Crea dos listas:
    - Una que se llame "valores" que tenga 7 n√∫meros aleatorios.
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los d√≠as de la semana.

In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
valores = random.sample(range(1,50), 7)
indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]

- A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los √≠ndices de la Serie.

In [3]:
serie_dias = pd.Series(valores, indices)
serie_dias

lunes        43
martes        3
miercoles    17
jueves       23
viernes      37
sabado       48
domingo      20
dtype: int64

- A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el m√©todo zip que nos permite iterar por dos listas a la vez. M√°s informci√≥n sobre este m√©todo aqu√≠.

In [4]:
dicc_dias = {}

list_zip = list(zip(valores, indices))

for i, j in zip(valores, indices):
    dicc_dias[j] = i
    
print(dicc_dias)

{'lunes': 43, 'martes': 3, 'miercoles': 17, 'jueves': 23, 'viernes': 37, 'sabado': 48, 'domingo': 20}

- Crea una Serie con el diccionario creado en el punto anterior.
- ¬øQu√© forma tiene esta √∫ltima Serie?
- ¬øQu√© tipo de datos tiene?
- ¬øQu√© tama√±o tiene?

In [5]:
serie_dias = pd.Series(dicc_dias)

serie_dias

lunes        43
martes        3
miercoles    17
jueves       23
viernes      37
sabado       48
domingo      20
dtype: int64

In [6]:
print(f'La forma es: {serie_dias.shape}')
print(f'El tama√±o es: {serie_dias.size}')
print(f'El tipo de dato: {serie_dias.dtype}')

La forma es: (7,)
El tama√±o es: 7
El tipo de dato: int64

- ¬øCu√°les son los √≠ndices de la Serie?
- ¬øY los values?
- Extraed el valor para el √≠ndice "lunes"
- Extraed el valor para el √≠ndice "lunes", "martes" y "mi√©rcoles".
- Extraed el valor para el √≠ndice "lunes" y "domingo".

In [7]:
print(f'Los indices son: {serie_dias.index}')
print(f'Los valores son: {serie_dias.values}')

Los indices son: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
Los valores son: [43  3 17 23 37 48 20]

In [8]:
serie_dias["lunes"]

43

In [9]:
serie_dias["lunes":"miercoles"]

lunes        43
martes        3
miercoles    17
dtype: int64

In [10]:
serie_dias[["lunes","domingo"]]

lunes      43
domingo    20
dtype: int64

3. Es el turno de los DataFrames
- Cread un array de dos dimensiones con 4 filas y 3 columnas.
- Convertid el array en un DataFrame donde las columnas se llamen "Espa√±a", "Francia" e "Italia".
- Descargad el archivo "medallas" y cargad el DataFrame con la siguiente l√≠nea de c√≥digo:
```python
df = pd.read_csv("medallas.csv", index_col=["Pa√≠s"])
```
üìå NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

In [11]:
array = np.random.randint(0,10,(4,3))
array

array([[7, 5, 6],
       [7, 4, 2],
       [5, 3, 8],
       [4, 2, 6]])

In [12]:
df_medallas = pd.DataFrame(array, columns = ["Espa√±a", "Francia", "Italia"])

df_medallas

   Espa√±a  Francia  Italia
0       7        5       6
1       7        4       2
2       5        3       8
3       4        2       6

In [13]:
df2 = pd.read_csv("datos/medallas.csv", index_col=["Pa√≠s"])
df2

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                     1  1473    994     720
Jap√≥n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir√°n                      4   179    181     197
Kazajist√°n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip√©i              9    99    144     276
Corea del Norte          10    91    120     235

- Usando el loc extraed todas las columnas de la fila de Tailandia.
- Usando el loc extraed todas las columnas de China e Ir√°n.
- Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir√°n.

In [14]:
df2.loc["Tailandia",:]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [15]:
df2.loc[["China", "Ir√°n"],:]

       Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China           1  1473    994     720
Ir√°n            4   179    181     197

In [16]:
df2.loc[["China", "Ir√°n"],"Oro":"Bronce"]

        Oro  Plata  Bronce
Pa√≠s
China  1473    994     720
Ir√°n    179    181     197

- Usando el iloc extraed la informaci√≥n de la India. Devolved todas las columnas.
- Usando el iloc extraed todas las columnas de los paises que est√©n en posici√≥n impar. La primera que nos tendr√≠a que salir es Jap√≥n y la √∫ltima Corea del Norte.
- Utilizando el c√≥digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [17]:
df2.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [18]:
df2.iloc[1::2]

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
Jap√≥n                     2  1032   1037     985
Ir√°n                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [19]:
df2.iloc[1::2,1:]

                  Oro  Plata  Bronce
Pa√≠s
Jap√≥n            1032   1037     985
Ir√°n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

- Contestad a las siguientes preguntas:
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro?
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro y m√°s de 1000 de plata?
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro o m√°s de 700 de bronce?

In [20]:
df2.loc[df2["Oro"] > 200]

               Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                   1  1473    994     720
Jap√≥n                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [21]:
df2.loc[(df2["Oro"] > 200) & (df2["Plata"] > 1000)]

       Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
Jap√≥n           2  1032   1037     985

In [22]:
df2.loc[(df2["Oro"] > 200) | (df2["Bronce"] > 700)]

               Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                   1  1473    994     720
Jap√≥n                   2  1032   1037     985
Corea del Sur           3   745    663     827

- Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [23]:
df3 = df2.drop(columns = ["Unnamed: 0"])

df3

                  Oro  Plata  Bronce
Pa√≠s
China            1473    994     720
Jap√≥n            1032   1037     985
Corea del Sur     745    663     827
Ir√°n              179    181     197
Kazajist√°n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taip√©i       99    144     276
Corea del Norte    91    120     235

- Cread una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa√≠s.

In [24]:
df4 = df3.assign(total= df3["Oro"] + df3["Plata"] + df3["Bronce"])

df4

                  Oro  Plata  Bronce  total
Pa√≠s
China            1473    994     720   3187
Jap√≥n            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Ir√°n              179    181     197    557
Kazajist√°n        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taip√©i       99    144     276    519
Corea del Norte    91    120     235    446